wdomski/PanTiltCameraRaspberryPiSTM32/stm32/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 ** This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * COPYRIGHT(c) 2018 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "i2c.h"
#include "tim.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

volatile uint8_t receiveCompleted;
volatile uint8_t dataReady;
//describes mode of operation ... set value, sweep
volatile uint8_t mode;
//designed flag for mode
//it is set i.e. in timer's callback
volatile uint8_t mode_flag;

uint8_t buffer[128];

uint8_t command;
uint16_t value;
float value_float;
uint8_t channel;
int16_t speed;
uint16_t value_max;
uint16_t value_min;
int8_t sweep_direction; //values of -1 or +1
uint32_t ret;

uint32_t availableChannels[] = { TIM_CHANNEL_1, TIM_CHANNEL_2, TIM_CHANNEL_3,
TIM_CHANNEL_4 };

uint32_t time;
uint32_t last_time;
uint8_t get_time;

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 *
 * @retval None
 */
int main(void) {
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_I2C1_Init();
	MX_TIM1_Init();
	MX_TIM2_Init();
	/* USER CODE BEGIN 2 */

	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 150);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 150);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 150);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 150);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
	mode = 0;

	//to detect some ongoing OLD transmission
	get_time = 1;

	//start base timer for 1 ms generator
	HAL_TIM_Base_Start_IT(&htim2);

	ret = HAL_I2C_Slave_Receive_IT(&hi2c1, buffer, 8);

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {
		if (receiveCompleted == 1) {
			receiveCompleted = 0;
			ret = HAL_I2C_Slave_Receive_IT(&hi2c1, buffer, 8);
		}

		//check if there is ongoing OLD transfer
		if (hi2c1.XferCount < 8) {
			if (get_time == 1) {
				last_time = HAL_GetTick();
				get_time = 0;
			} else {
				time = HAL_GetTick();
				if (time - last_time > 200) {
					//reset transmission
					HAL_I2C_DeInit(&hi2c1);
					HAL_Delay(20);
					MX_I2C1_Init();
					HAL_Delay(20);
					ret = HAL_I2C_Slave_Receive_IT(&hi2c1, buffer, 8);
					get_time = 1;
				}
			}
		}

		//reading 8 bytes
		//1st byte -- command

		if (dataReady == 1) {
			dataReady = 0;
			command = (uint8_t) buffer[0];
			switch (command) {
			//set position
			case 0: {
				//0 -- command
				//1 -- channel
				//2-3 -- set value
				channel = buffer[1];
				value = *(uint16_t*) &buffer[2];

				__HAL_TIM_SET_COMPARE(&htim1, availableChannels[channel],
						value);

				mode = 0;

				break;
			}
				//scan
			case 1: {
				//0 -- command
				//1 -- channel
				//2-3 -- set value (speed) [ 0.1 impulses / sec]
				//4-5 -- max value
				//6-7 -- min value

				channel = buffer[1];
				speed = *(uint16_t*) &buffer[2];
				value_max = *(uint16_t*) &buffer[4];
				value_min = *(uint16_t*) &buffer[6];

				//get current value to start from
				value = __HAL_TIM_GET_COMPARE(&htim1,
						availableChannels[channel]);

				if (value > value_max)
					value = value_max;
				if (value < value_min)
					value = value_min;

				value_float = value;

				sweep_direction = +1;

				mode = 1;
				break;
			}
			}

		}

		if (mode_flag == 1) {
			mode_flag = 0;
			if (mode == 1) {

				if (value >= value_max)
					sweep_direction = -1;
				if (value <= value_min)
					sweep_direction = +1;

				// direction * time base * speed * sweep coefficient
				value_float += (float) sweep_direction * 0.001f * (float) speed
						* 0.1f;
				value = value_float;

				__HAL_TIM_SET_COMPARE(&htim1, availableChannels[channel],
						value);
			}
		}

		if (mode != 1)
			HAL_Delay(10);

		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */

	}
	/* USER CODE END 3 */

}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim == &htim2) {
		//check if it is sweep mode
		if (mode == 1) {
			mode_flag = 1;
		}
	}
}

void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef *hi2c) {
	receiveCompleted = 1;
	dataReady = 1;
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  file: The file name as string.
 * @param  line: The line in file as a number.
 * @retval None
 */
void _Error_Handler(char *file, int line) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
	 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
